app/views/rooms/index.html.erb

SELECT "datapoints".* FROM "datapoints" WHERE (room_name = 'Babbage 102 Rows A-J')
---
              <div class="col-md-12">
                <h4 style="color:green;">Seats Available: <%= Datapoint.where("room_name = ?", room.room_name).last.total_available %> out of <%= Datapoint.where("room_name = ?", room.room_name).last.total_rooms %></h4>

SELECT  "days".* FROM "days" WHERE (room_name = 'Babbage 102 Rows A-J')  ORDER BY "days"."id" DESC LIMIT 1
---
              <tbody>
                <% Day.where("room_name = ?", room.room_name).last.full_data[1..-1].each_with_index do |item, index| %> <!-- new -->