app/controllers/rooms_controller.rb

  def index
    @rooms =  Datapoint.select("room_name").group("room_name")
    @room_array = []
    @thingy = Datapoint.all.sample
---
SELECT "datapoints"."room_name" FROM "datapoints" GROUP BY "datapoints"."room_name"
SELECT "datapoints".* FROM "datapoints" WHERE (room_name = 'Babbage 102 Rows A-J')

  def display_props
    @rooms = Datapoint.all
---
SELECT "datapoints".* FROM "datapoints"